ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan0.h
#define DMA_CHAN0_CONTROL_RESETVALUE        (0x00U)                                       /**<  (DMA_CHAN0_CONTROL) DMA Channel N Control  Reset Value */

#define DMA_CHAN0_CONTROL_RUN_Pos             (0)                                            /**< (DMA_CHAN0_CONTROL) This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored. Position */
#define DMA_CHAN0_CONTROL_RUN_Msk             (0x1U << DMA_CHAN0_CONTROL_RUN_Pos)            /**< (DMA_CHAN0_CONTROL) This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored. Mask */
#define DMA_CHAN0_CONTROL_REQUEST_Pos         (1)                                            /**< (DMA_CHAN0_CONTROL) This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device Position */
#define DMA_CHAN0_CONTROL_REQUEST_Msk         (0x1U << DMA_CHAN0_CONTROL_REQUEST_Pos)        /**< (DMA_CHAN0_CONTROL) This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device Mask */
#define DMA_CHAN0_CONTROL_DONE_Pos            (2)                                            /**< (DMA_CHAN0_CONTROL) This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF Position */
#define DMA_CHAN0_CONTROL_DONE_Msk            (0x1U << DMA_CHAN0_CONTROL_DONE_Pos)           /**< (DMA_CHAN0_CONTROL) This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF Mask */
#define DMA_CHAN0_CONTROL_STATUS_Pos          (3)                                            /**< (DMA_CHAN0_CONTROL) This is a status signal. The status decode is listed in priority order with the highest priority first.\n                  3: Error detected by the DMA\n                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term\n                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address\n                  0: DMA Channel Control:Run is Disabled (0x0) Position */
#define DMA_CHAN0_CONTROL_STATUS_Msk          (0x3U << DMA_CHAN0_CONTROL_STATUS_Pos)         /**< (DMA_CHAN0_CONTROL) This is a status signal. The status decode is listed in priority order with the highest priority first.\n                  3: Error detected by the DMA\n                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term\n                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address\n                  0: DMA Channel Control:Run is Disabled (0x0) Mask */
#define DMA_CHAN0_CONTROL_STATUS(value)       (DMA_CHAN0_CONTROL_STATUS_Msk & ((value) << DMA_CHAN0_CONTROL_STATUS_Pos))
#define DMA_CHAN0_CONTROL_BUSY_Pos            (5)                                            /**< (DMA_CHAN0_CONTROL) This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE) Position */
#define DMA_CHAN0_CONTROL_BUSY_Msk            (0x1U << DMA_CHAN0_CONTROL_BUSY_Pos)           /**< (DMA_CHAN0_CONTROL) This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE) Mask */
#define DMA_CHAN0_CONTROL_TX_DIRECTION_Pos    (8)                                            /**< (DMA_CHAN0_CONTROL) This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address Position */
#define DMA_CHAN0_CONTROL_TX_DIRECTION_Msk    (0x1U << DMA_CHAN0_CONTROL_TX_DIRECTION_Pos)   /**< (DMA_CHAN0_CONTROL) This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address Mask */
#define DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE_Pos (9)                                            /**< (DMA_CHAN0_CONTROL) This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done. Position */
#define DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE_Msk (0x7FU << DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE_Pos)  /**< (DMA_CHAN0_CONTROL) This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done. Mask */
#define DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE(value) (DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE_Msk & ((value) << DMA_CHAN0_CONTROL_HARDWARE_FLOW_CONTROL_DEVICE_Pos))
#define DMA_CHAN0_CONTROL_INCREMENT_MEM_ADDR_Pos (16)                                           /**< (DMA_CHAN0_CONTROL) This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing Position */
#define DMA_CHAN0_CONTROL_INCREMENT_MEM_ADDR_Msk (0x1U << DMA_CHAN0_CONTROL_INCREMENT_MEM_ADDR_Pos)  /**< (DMA_CHAN0_CONTROL) This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing Mask */
#define DMA_CHAN0_CONTROL_INCREMENT_DEVICE_ADDR_Pos (17)                                           /**< (DMA_CHAN0_CONTROL) This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing Position */
#define DMA_CHAN0_CONTROL_INCREMENT_DEVICE_ADDR_Msk (0x1U << DMA_CHAN0_CONTROL_INCREMENT_DEVICE_ADDR_Pos)  /**< (DMA_CHAN0_CONTROL) This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing Mask */
#define DMA_CHAN0_CONTROL_LOCK_Pos            (18)                                           /**< (DMA_CHAN0_CONTROL) This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions). Position */
#define DMA_CHAN0_CONTROL_LOCK_Msk            (0x1U << DMA_CHAN0_CONTROL_LOCK_Pos)           /**< (DMA_CHAN0_CONTROL) This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions). Mask */
#define DMA_CHAN0_CONTROL_DISABLE_HW_FLOW_CONTROL_Pos (19)                                           /**< (DMA_CHAN0_CONTROL) This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode. Position */
#define DMA_CHAN0_CONTROL_DISABLE_HW_FLOW_CONTROL_Msk (0x1U << DMA_CHAN0_CONTROL_DISABLE_HW_FLOW_CONTROL_Pos)  /**< (DMA_CHAN0_CONTROL) This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode. Mask */
#define DMA_CHAN0_CONTROL_TRANSFER_SIZE_Pos   (20)                                           /**< (DMA_CHAN0_CONTROL) This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes. Position */
#define DMA_CHAN0_CONTROL_TRANSFER_SIZE_Msk   (0x7U << DMA_CHAN0_CONTROL_TRANSFER_SIZE_Pos)  /**< (DMA_CHAN0_CONTROL) This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes. Mask */
#define DMA_CHAN0_CONTROL_TRANSFER_SIZE(value) (DMA_CHAN0_CONTROL_TRANSFER_SIZE_Msk & ((value) << DMA_CHAN0_CONTROL_TRANSFER_SIZE_Pos))
#define DMA_CHAN0_CONTROL_TRANSFER_GO_Pos     (24)                                           /**< (DMA_CHAN0_CONTROL) This is used for the Firmware Flow Control DMA transfer. Position */
#define DMA_CHAN0_CONTROL_TRANSFER_GO_Msk     (0x1U << DMA_CHAN0_CONTROL_TRANSFER_GO_Pos)    /**< (DMA_CHAN0_CONTROL) This is used for the Firmware Flow Control DMA transfer. Mask */
#define DMA_CHAN0_CONTROL_TRANSFER_ABORT_Pos  (25)                                           /**< (DMA_CHAN0_CONTROL) This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately. Position */
#define DMA_CHAN0_CONTROL_TRANSFER_ABORT_Msk  (0x1U << DMA_CHAN0_CONTROL_TRANSFER_ABORT_Pos)  /**< (DMA_CHAN0_CONTROL) This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately. Mask */
#define DMA_CHAN0_CONTROL_Msk                 (0x037FFF3FUL)                                 /**< (DMA_CHAN0_CONTROL) Register Mask  */

/* -------- DMA_CHAN0_INT_STATUS : (DMA_CHAN0 Offset: 0x14) (R/W 8) DMA Channel N Interrupt Status -------- */

typedef union
{
  struct
  {
    uint8_t  BUS_ERROR:1;               /**< bit:      0  This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) */
    uint8_t  FLOW_CONTROL:1;            /**< bit:      1  This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event */
    uint8_t  DONE:1;                    /**< bit:      2  This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __DMA_CHAN0_INT_STATUS_bits_t;
