ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan0.h
#define DMA_CHAN0_INT_STATUS_RESETVALUE     (0x00U)                                       /**<  (DMA_CHAN0_INT_STATUS) DMA Channel N Interrupt Status  Reset Value */

#define DMA_CHAN0_INT_STATUS_BUS_ERROR_Pos    (0)                                            /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Position */
#define DMA_CHAN0_INT_STATUS_BUS_ERROR_Msk    (0x1U << DMA_CHAN0_INT_STATUS_BUS_ERROR_Pos)   /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when there is an Error detected over the internal 32-bit Bus.\n                  1: Error detected. (R/WC) Mask */
#define DMA_CHAN0_INT_STATUS_FLOW_CONTROL_Pos (1)                                            /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Position */
#define DMA_CHAN0_INT_STATUS_FLOW_CONTROL_Msk (0x1U << DMA_CHAN0_INT_STATUS_FLOW_CONTROL_Pos)  /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has encountered a Hardware Flow Control Request\n     after the DMA Channel has completed the transfer. This means the Master Device is attempting to overflow the DMA.\n                  1=Hardware Flow Control is requesting after the transfer has completed\n                  0=No Hardware Flow Control event Mask */
#define DMA_CHAN0_INT_STATUS_DONE_Pos         (2)                                            /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Position */
#define DMA_CHAN0_INT_STATUS_DONE_Msk         (0x1U << DMA_CHAN0_INT_STATUS_DONE_Pos)        /**< (DMA_CHAN0_INT_STATUS) This is an interrupt source register. This flags when the DMA Channel has completed a transfer successfully on its side.\n     A completed transfer is defined as when the DMA Channel reaches its limit; Memory Start Address equals Memory End Address.\n     A completion due to a Hardware Flow Control Terminate will not flag this interrupt.\n                  1=Memory Start Address equals Memory End Address\n                  0=Memory Start Address does not equal Memory End Address Mask */
#define DMA_CHAN0_INT_STATUS_Msk              (0x00000007UL)                                 /**< (DMA_CHAN0_INT_STATUS) Register Mask  */

/* -------- DMA_CHAN0_INT_EN : (DMA_CHAN0 Offset: 0x18) (R/W 8) DMA CHANNEL N INTERRUPT ENABLE -------- */

typedef union
{
  struct
  {
    uint8_t  STATUS_ENABLE_BUS_ERROR:1;  /**< bit:      0  This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_FLOW_CONTROL:1;  /**< bit:      1  This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_DONE:1;      /**< bit:      2  This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __DMA_CHAN0_INT_EN_bits_t;
#define DMA_CHAN0_INT_EN_RESETVALUE         (0x00U)                                       /**<  (DMA_CHAN0_INT_EN) DMA CHANNEL N INTERRUPT ENABLE  Reset Value */

#define DMA_CHAN0_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos (0)                                            /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN0_INT_EN_STATUS_ENABLE_BUS_ERROR_Msk (0x1U << DMA_CHAN0_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos)  /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN0_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos (1)                                            /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN0_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Msk (0x1U << DMA_CHAN0_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos)  /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN0_INT_EN_STATUS_ENABLE_DONE_Pos (2)                                            /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN0_INT_EN_STATUS_ENABLE_DONE_Msk (0x1U << DMA_CHAN0_INT_EN_STATUS_ENABLE_DONE_Pos)  /**< (DMA_CHAN0_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN0_INT_EN_Msk                  (0x00000007UL)                                 /**< (DMA_CHAN0_INT_EN) Register Mask  */

/* -------- DMA_CHAN0_CRC_ENABLE : (DMA_CHAN0 Offset: 0x20) (R/W 32) DMA CHANNEL N CRC ENABLE -------- */

typedef union
{
  struct
  {
    uint32_t CRC_MODE_ENABLE:1;         /**< bit:      0  1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N */
    uint32_t CRC_POST_TRANSFER_ENABLE:1;  /**< bit:      1  The bit enables the transfer of the calculated CRC-32 after the completion of the DMA transaction.\n     If the DMA transaction is aborted by either firmware or an internal bus error, the transfer will not occur.\n     If the target of the DMA transfer is a device and the device signaled the termination of the DMA transaction,\n     the CRC post transfer will not occur.\n     1=Enable the transfer of CRC-32 for DMA Channel N after the DMA transaction completes\n     0=Disable the automatic transfer of the CRC */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DMA_CHAN0_CRC_ENABLE_bits_t;
#define DMA_CHAN0_CRC_ENABLE_RESETVALUE     (0x00U)                                       /**<  (DMA_CHAN0_CRC_ENABLE) DMA CHANNEL N CRC ENABLE  Reset Value */

#define DMA_CHAN0_CRC_ENABLE_CRC_MODE_ENABLE_Pos (0)                                            /**< (DMA_CHAN0_CRC_ENABLE) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Position */
#define DMA_CHAN0_CRC_ENABLE_CRC_MODE_ENABLE_Msk (0x1U << DMA_CHAN0_CRC_ENABLE_CRC_MODE_ENABLE_Pos)  /**< (DMA_CHAN0_CRC_ENABLE) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Mask */
#define DMA_CHAN0_CRC_ENABLE_CRC_POST_TRANSFER_ENABLE_Pos (1)                                            /**< (DMA_CHAN0_CRC_ENABLE) The bit enables the transfer of the calculated CRC-32 after the completion of the DMA transaction.\n     If the DMA transaction is aborted by either firmware or an internal bus error, the transfer will not occur.\n     If the target of the DMA transfer is a device and the device signaled the termination of the DMA transaction,\n     the CRC post transfer will not occur.\n     1=Enable the transfer of CRC-32 for DMA Channel N after the DMA transaction completes\n     0=Disable the automatic transfer of the CRC Position */
#define DMA_CHAN0_CRC_ENABLE_CRC_POST_TRANSFER_ENABLE_Msk (0x1U << DMA_CHAN0_CRC_ENABLE_CRC_POST_TRANSFER_ENABLE_Pos)  /**< (DMA_CHAN0_CRC_ENABLE) The bit enables the transfer of the calculated CRC-32 after the completion of the DMA transaction.\n     If the DMA transaction is aborted by either firmware or an internal bus error, the transfer will not occur.\n     If the target of the DMA transfer is a device and the device signaled the termination of the DMA transaction,\n     the CRC post transfer will not occur.\n     1=Enable the transfer of CRC-32 for DMA Channel N after the DMA transaction completes\n     0=Disable the automatic transfer of the CRC Mask */
#define DMA_CHAN0_CRC_ENABLE_Msk              (0x00000003UL)                                 /**< (DMA_CHAN0_CRC_ENABLE) Register Mask  */

/* -------- DMA_CHAN0_CRC_DATA : (DMA_CHAN0 Offset: 0x24) (R/W 32) DMA CHANNEL N CRC DATA -------- */

typedef union
{
  struct
  {
    uint32_t CRC:32;                    /**< bit:  0..31  Writes to this register initialize the CRC generator. Reads from this register return the output of the\n     CRC that is calculated from the data transferred by DMA Channel N. The output of the CRC generator is bit-reversed\n     and inverted on reads, as required by the CRC-32-IEEE definition. A CRC can be accumulated across multiple DMA transactions\n     on Channel N. If it is necessary to save the intermediate CRC value, the result of the read of this register must be\n     bit-reversed and inverted before being written back to this register. */
  };
  uint32_t w;
} __DMA_CHAN0_CRC_DATA_bits_t;
#define DMA_CHAN0_CRC_DATA_RESETVALUE       (0x00U)                                       /**<  (DMA_CHAN0_CRC_DATA) DMA CHANNEL N CRC DATA  Reset Value */

#define DMA_CHAN0_CRC_DATA_CRC_Pos            (0)                                            /**< (DMA_CHAN0_CRC_DATA) Writes to this register initialize the CRC generator. Reads from this register return the output of the\n     CRC that is calculated from the data transferred by DMA Channel N. The output of the CRC generator is bit-reversed\n     and inverted on reads, as required by the CRC-32-IEEE definition. A CRC can be accumulated across multiple DMA transactions\n     on Channel N. If it is necessary to save the intermediate CRC value, the result of the read of this register must be\n     bit-reversed and inverted before being written back to this register. Position */
#define DMA_CHAN0_CRC_DATA_CRC_Msk            (0xFFFFFFFFU << DMA_CHAN0_CRC_DATA_CRC_Pos)    /**< (DMA_CHAN0_CRC_DATA) Writes to this register initialize the CRC generator. Reads from this register return the output of the\n     CRC that is calculated from the data transferred by DMA Channel N. The output of the CRC generator is bit-reversed\n     and inverted on reads, as required by the CRC-32-IEEE definition. A CRC can be accumulated across multiple DMA transactions\n     on Channel N. If it is necessary to save the intermediate CRC value, the result of the read of this register must be\n     bit-reversed and inverted before being written back to this register. Mask */
#define DMA_CHAN0_CRC_DATA_CRC(value)         (DMA_CHAN0_CRC_DATA_CRC_Msk & ((value) << DMA_CHAN0_CRC_DATA_CRC_Pos))
#define DMA_CHAN0_CRC_DATA_Msk                (0xFFFFFFFFUL)                                 /**< (DMA_CHAN0_CRC_DATA) Register Mask  */

/* -------- DMA_CHAN0_CRC_POST_STATUS : (DMA_CHAN0 Offset: 0x28) (R/W 32) DMA CHANNEL N CRC POST STATUS -------- */

typedef union
{
  struct
  {
    uint32_t CRC_DONE:1;                /**< bit:      0  This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. */
    uint32_t CRC_RUNNING:1;             /**< bit:      1  This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. */
    uint32_t CRC_DATA_DONE:1;           /**< bit:      2  This bit is set to '1b' when the DMA controller has completed the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the a new DMA transfer starts. */
    uint32_t CRC_DATA_READY:1;          /**< bit:      3  This bit is set to '1b' when the DMA controller is processing the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the post-transfer completes. */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __DMA_CHAN0_CRC_POST_STATUS_bits_t;
