ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan0.h
#define DMA_CHAN0_CRC_POST_STATUS_RESETVALUE (0x00U)                                       /**<  (DMA_CHAN0_CRC_POST_STATUS) DMA CHANNEL N CRC POST STATUS  Reset Value */

#define DMA_CHAN0_CRC_POST_STATUS_CRC_DONE_Pos (0)                                            /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Position */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_DONE_Msk (0x1U << DMA_CHAN0_CRC_POST_STATUS_CRC_DONE_Pos)  /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Mask */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_RUNNING_Pos (1)                                            /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Position */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_RUNNING_Msk (0x1U << DMA_CHAN0_CRC_POST_STATUS_CRC_RUNNING_Pos)  /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Mask */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_DONE_Pos (2)                                            /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller has completed the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the a new DMA transfer starts. Position */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_DONE_Msk (0x1U << DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_DONE_Pos)  /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller has completed the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the a new DMA transfer starts. Mask */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_READY_Pos (3)                                            /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller is processing the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the post-transfer completes. Position */
#define DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_READY_Msk (0x1U << DMA_CHAN0_CRC_POST_STATUS_CRC_DATA_READY_Pos)  /**< (DMA_CHAN0_CRC_POST_STATUS) This bit is set to '1b' when the DMA controller is processing the post-transfer of the CRC data.\n     This bit is cleared to '0b' when the post-transfer completes. Mask */
#define DMA_CHAN0_CRC_POST_STATUS_Msk         (0x0000000FUL)                                 /**< (DMA_CHAN0_CRC_POST_STATUS) Register Mask  */

/** \brief DMA_CHAN0 register offsets definitions */
#define DMA_CHAN0_DMA_CHANNEL_ACTIVATE_OFFSET (0x00)         /**< (DMA_CHAN0_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. Offset */
#define DMA_CHAN0_MEMORY_START_ADDRESS_OFFSET (0x04)         /**< (DMA_CHAN0_MEMORY_START_ADDRESS) This is the starting address for the Memory device. Offset */
#define DMA_CHAN0_MEMORY_END_ADDRESS_OFFSET (0x08)         /**< (DMA_CHAN0_MEMORY_END_ADDRESS) This is the ending address for the Memory device. Offset */
#define DMA_CHAN0_DEVICE_ADDRESS_OFFSET (0x0C)         /**< (DMA_CHAN0_DEVICE_ADDRESS) This is the Master Device address. Offset */
#define DMA_CHAN0_CONTROL_OFFSET     (0x10)         /**< (DMA_CHAN0_CONTROL) DMA Channel N Control Offset */
#define DMA_CHAN0_INT_STATUS_OFFSET  (0x14)         /**< (DMA_CHAN0_INT_STATUS) DMA Channel N Interrupt Status Offset */
#define DMA_CHAN0_INT_EN_OFFSET      (0x18)         /**< (DMA_CHAN0_INT_EN) DMA CHANNEL N INTERRUPT ENABLE Offset */
#define DMA_CHAN0_CRC_ENABLE_OFFSET  (0x20)         /**< (DMA_CHAN0_CRC_ENABLE) DMA CHANNEL N CRC ENABLE Offset */
#define DMA_CHAN0_CRC_DATA_OFFSET    (0x24)         /**< (DMA_CHAN0_CRC_DATA) DMA CHANNEL N CRC DATA Offset */
#define DMA_CHAN0_CRC_POST_STATUS_OFFSET (0x28)         /**< (DMA_CHAN0_CRC_POST_STATUS) DMA CHANNEL N CRC POST STATUS Offset */

/** \brief DMA_CHAN0 register API structure */
typedef struct
{  /* DMA Channel 00 Registers */
  __IO  __DMA_CHAN0_DMA_CHANNEL_ACTIVATE_bits_t DMA_CHANNEL_ACTIVATE; /**< Offset: 0x00 (R/W   8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. */
  __IO  __DMA_CHAN0_MEMORY_START_ADDRESS_bits_t MEMORY_START_ADDRESS; /**< Offset: 0x04 (R/W  32) This is the starting address for the Memory device. */
  __IO  __DMA_CHAN0_MEMORY_END_ADDRESS_bits_t MEMORY_END_ADDRESS; /**< Offset: 0x08 (R/W  32) This is the ending address for the Memory device. */
  __IO  __DMA_CHAN0_DEVICE_ADDRESS_bits_t DEVICE_ADDRESS; /**< Offset: 0x0C (R/W  32) This is the Master Device address. */
  __IO  __DMA_CHAN0_CONTROL_bits_t     CONTROL;       /**< Offset: 0x10 (R/W  32) DMA Channel N Control */
  __IO  __DMA_CHAN0_INT_STATUS_bits_t  INT_STATUS;    /**< Offset: 0x14 (R/W   8) DMA Channel N Interrupt Status */
  __IO  __DMA_CHAN0_INT_EN_bits_t      INT_EN;        /**< Offset: 0x18 (R/W   8) DMA CHANNEL N INTERRUPT ENABLE */
  __IO  __DMA_CHAN0_CRC_ENABLE_bits_t  CRC_ENABLE;    /**< Offset: 0x20 (R/W  32) DMA CHANNEL N CRC ENABLE */
  __IO  __DMA_CHAN0_CRC_DATA_bits_t    CRC_DATA;      /**< Offset: 0x24 (R/W  32) DMA CHANNEL N CRC DATA */
  __IO  __DMA_CHAN0_CRC_POST_STATUS_bits_t CRC_POST_STATUS; /**< Offset: 0x28 (R/W  32) DMA CHANNEL N CRC POST STATUS */
} dmachan0_registers_t;
/** @}  end of DMA Channel 00 Registers */

#endif /* _PIC32CX_0525SG12_DMA_CHAN0_COMPONENT_H_ */
